Revit 2027 API
ElectricalLoadClassification.PanelConnectedCurrentLabel Property
 The name template for the connected current parameter on the load classification.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PanelConnectedCurrentLabel { get; set; }
Public Property PanelConnectedCurrentLabel As String
	Get
	Set
public:
property String^ PanelConnectedCurrentLabel {
	String^ get ();
	void set (String^ value);
}
member PanelConnectedCurrentLabel : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: panelConnectedCurrentLabel is not a valid globalization format string.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace